import { GET_USERS } from "./actionType"

// متد زیر یک آبجکت خالی را بر میگرداند
// export const userGet = () => {
//     return {}
// }

// متد زیر یک اکشن اس با تایپ مورد نظر
// که زمانی که فراخوانی شود در ریدیوسر به طور مثال بوسیله سوییچ
// میتوان پردازشی روی استیت مورد نظر انجام داد
export const userGet = () => {
    return {
        type: GET_USERS
    }
}

// بوسیله متد زیر میتوان
// اکشنی فراخوانی کرد که دارای
// payload و type 
// نباشد
// که اینکار باعث فعال شدن ریداکش تانک میشود طبق تحقیقاتی که انجام دادم
// و بطور مثال میتوان چند اکشن را با هم یکجا فراخوانی کرد

export const all = () => {
    return function(dispatch, getState) {
        
    }
}